[
  {
    "id": 1,
    "name": "Шарлотка классическая",
    "description": "Простой и воздушный яблочный пирог на бисквитной основе.",
    "recipe": "1. Взбить яйца с сахаром до пышности. 2. Добавить просеянную муку и разрыхлитель, аккуратно перемешать. 3. Яблоки нарезать дольками, добавить в тесто. 4. Вылить тесто в смазанную форму. 5. Выпекать 40-45 минут при 180°C.",
    "ingredient_ids": [1, 2, 4, 9, 30]
  },
  {
    "id": 2,
    "name": "Тирамису",
    "description": "Знаменитый итальянский десерт с кофейным вкусом и нежным кремом.",
    "recipe": "1. Взбить маскарпоне с сахарной пудрой. 2. Добавить желтки и взбить в крем. 3. Печенье обмакнуть в охлажденный кофе и выложить в форму. 4. На печенье выложить часть крема, повторить слои. 5. Посыпать какао и охладить 6 часов.",
    "ingredient_ids": [24, 3, 4, 25, 36, 12]
  },
  {
    "id": 3,
    "name": "Песочное печенье",
    "description": "Рассыпчатое и нежное печенье, тающее во рту.",
    "recipe": "1. Перетереть муку с холодным маслом в крошку. 2. Добавить сахар, яйцо и замесить тесто. 3. Убрать тесто в холод на 30 мин. 4. Раскатать, вырезать фигурки. 5. Выпекать 15-20 мин при 190°C до золотистого цвета.",
    "ingredient_ids": [1, 2, 5, 4, 35]
  },
  {
    "id": 4,
    "name": "Медовик",
    "description": "Легендарный торт с медовыми коржами и сметанным кремом.",
    "recipe": "1. Смешать мед, масло, сахар, соду и яйца на водяной бане до однородности. 2. Ввести муку, замесить тесто. 3. Разделить на коржи, испечь каждый. 4. Взбить сметану с сахаром для крема. 5. Промазать остывшие коржи кремом и дать пропитаться.",
    "ingredient_ids": [1, 2, 4, 5, 7, 10, 14]
  },
  {
    "id": 5,
    "name": "Сырники с изюмом",
    "description": "Нежные творожные оладьи с сладкими изюминками.",
    "recipe": "1. Творог протереть через сито. 2. Добавить яйцо, муку, сахар и изюм. Замесить. 3. Сформировать сырники, обвалять в муке. 4. Обжарить на сливочном масле до золотистой корочки с двух сторон.",
    "ingredient_ids": [8, 1, 2, 4, 17, 5]
  },
  {
    "id": 6,
    "name": "Шоколадный фондан",
    "description": "Декadentный десерт с жидкой шоколадной сердцевиной.",
    "recipe": "1. Растопить шоколад и масло. 2. Взбить яйца с сахаром. 3. Соединить шоколадную и яичную смеси. 4. Добавить муку, перемешать. 5. Разлить по формочкам, выпекать 10-12 мин при 200°C.",
    "ingredient_ids": [13, 5, 4, 2, 1]
  },
  {
    "id": 7,
    "name": "Панна-котта ванильная",
    "description": "Итальянский сливочный десерт, нежный и упругий.",
    "recipe": "1. Замочить желатин в холодной воде. 2. Сливки с сахаром и ванилином нагреть, но не кипятить. 3. Растворить в теплых сливках отжатый желатин. 4. Процедить смесь, разлить по формам. 5. Охладить 4 часа.",
    "ingredient_ids": [23, 2, 11, 22]
  },
  {
    "id": 8,
    "name": "Маффины с черникой",
    "description": "Нежные кексы с сочными ягодами внутри.",
    "recipe": "1. Взбить яйца с сахаром и маслом. 2. Добавить молоко, муку с разрыхлителем. 3. Аккуратно ввести ягоды. 4. Разлить тесто по формочкам на 2/3. 5. Выпекать 25 мин при 180°C.",
    "ingredient_ids": [1, 2, 4, 5, 6, 9, 27]
  },
  {
    "id": 9,
    "name": "Творожная запеканка",
    "description": "Воздушная и полезная запеканка, идеальна для завтрака.",
    "recipe": "1. Творог протереть. 2. Смешать с яйцами, сахаром, манкой и сметаной. 3. Оставить на 20 мин для набухания манки. 4. Выложить в смазанную форму. 5. Выпекать 40 мин при 180°C.",
    "ingredient_ids": [8, 4, 2, 7]
  },
  {
    "id": 10,
    "name": "Брауни",
    "description": "Плотный, влажный и очень шоколадный американский пирог.",
    "recipe": "1. Растопить шоколад с маслом. 2. Взбить яйца с сахаром. 3. Соединить обе смеси. 4. Добавить муку и какао, перемешать. 5. Выпекать 25-30 мин при 170°C.",
    "ingredient_ids": [13, 5, 4, 2, 1, 12]
  },
  {
    "id": 11,
    "name": "Мороженое пломбир",
    "description": "Домашнее сливочное мороженое без консервантов.",
    "recipe": "1. Сливки взбить до устойчивых пиков. 2. Смешать молоко, сахар и ванилин, нагреть до растворения сахара. 3. Охладить молочную смесь, соединить со взбитыми сливками. 4. Перелить в контейнер, заморозить, взбивая каждые 2 часа.",
    "ingredient_ids": [23, 6, 2, 11]
  },
  {
    "id": 12,
    "name": "Клубничный чизкейк",
    "description": "Нежный десерт на основе творожного сыра с клубничной прослойкой.",
    "recipe": "1. Измельчить печенье, смешать с маслом, выложить основу. 2. Взбить сыр с сахаром, добавить яйца по одному. 3. Вылить на основу. 4. Выпекать на водяной бане 1 час при 160°C. 5. Украсить клубникой.",
    "ingredient_ids": [25, 5, 31, 2, 4, 27]
  },
  {
    "id": 13,
    "name": "Овсяное печенье с клюквой",
    "description": "Полезное и сытное печенье с кислинкой.",
    "recipe": "1. Смешать овсяные хлопья, муку, разрыхлитель. 2. Взбить масло с сахаром, добавить яйцо. 3. Соединить сухие и влажные ингредиенты, добавить клюкву. 4. Сформировать печенье, выпекать 15-20 мин при 180°C.",
    "ingredient_ids": [1, 2, 5, 4, 9, 17]
  },
  {
    "id": 14,
    "name": "Эклеры с заварным кремом",
    "description": "Воздушные пирожные из заварного теста с нежным кремом.",
    "recipe": "1. Сварить заварное тесто: вода, масло, мука, яйца. 2. Отсадить эклеры. 3. Выпекать 30 мин при 200°C. 4. Взбить заварной крем из молока, яиц, сахара и муки. 5. Начинить остывшие эклеры кремом.",
    "ingredient_ids": [1, 5, 4, 6, 2]
  },
  {
    "id": 15,
    "name": "Пирог «Зебра»",
    "description": "Мраморный бисквитный пирог с чередованием светлого и шоколадного теста.",
    "recipe": "1. Взбить яйца с сахаром. 2. Добавить сметану, масло, муку с разрыхлителем. 3. Разделить тесто на две части, в одну добавить какао. 4. Чередовать ложки светлого и темного теста в форме. 5. Выпекать 40 мин при 180°C.",
    "ingredient_ids": [4, 2, 7, 5, 1, 9, 12]
  },
  {
    "id": 16,
    "name": "Трюфели шоколадные",
    "description": "Изысканные шоколадные конфеты ручной работы.",
    "recipe": "1. Подогреть сливки, залить ими измельченный шоколад. 2. Добавить масло, размешать до гладкости. 3. Охладить массу, сформировать шарики. 4. Обвалять в какао или орехах.",
    "ingredient_ids": [13, 23, 5, 12, 15]
  },
  {
    "id": 17,
    "name": "Крем-брюле",
    "description": "Французский крем с хрустящей карамельной корочкой.",
    "recipe": "1. Сливки с ванилью нагреть. 2. Желтки взбить с сахаром. 3. Соединить, прогреть на водяной бане до загустения. 4. Разлить по формам, охладить. 5. Посыпать сахаром и карамелизовать горелкой.",
    "ingredient_ids": [4, 2, 23, 11]
  },
  {
    "id": 18,
    "name": "Пряники медовые",
    "description": "Ароматные мягкие пряники с глазурью.",
    "recipe": "1. Смешать мед, масло, сахар, специи, нагреть. 2. Охладить, добавить яйцо, муку с содой. 3. Замесить тесто, дать отдохнуть. 4. Вырезать пряники, выпекать 15 мин при 180°C. 5. Украсить глазурью.",
    "ingredient_ids": [1, 2, 5, 4, 14, 10, 20, 21]
  },
  {
    "id": 19,
    "name": "Мусс шоколадный",
    "description": "Воздушный и легкий шоколадный десерт.",
    "recipe": "1. Растопить шоколад. 2. Взбить белки в крепкую пену. 3. Аккуратно соединить шоколад с белками. 4. Разлить по креманкам, охладить 3 часа.",
    "ingredient_ids": [13, 4]
  },
  {
    "id": 20,
    "name": "Чизкейк Нью-Йорк",
    "description": "Классический плотный и насыщенный чизкейк без выпечки.",
    "recipe": "1. Измельчить печенье, смешать с маслом - сделать основу. 2. Взбить крем-сыр с сахарной пудрой и сливками. 3. Растворить желатин, добавить в сырную массу. 4. Вылить на основу, охладить 6 часов.",
    "ingredient_ids": [25, 5, 38, 3, 23, 22]
  },
  {
    "id": 21,
    "name": "Безе",
    "description": "Воздушное безе, хрустящее снаружи и нежное внутри.",
    "recipe": "1. Взбить белки с сахаром до твердых пиков. 2. Добавить лимонный сок, взбить еще минуту. 3. Отсадить безе на пергамент. 4. Сушить 1.5-2 часа при 100°C.",
    "ingredient_ids": [4, 3, 29]
  },
  {
    "id": 22,
    "name": "Кекс «Мраморный»",
    "description": "Нежный кекс с чередованием ванильного и шоколадного теста.",
    "recipe": "1. Взбить масло с сахаром. 2. Добавить яйца по одному. 3. Добавить муку с разрыхлителем. 4. Разделить тесто, в одну часть добавить какао. 5. Выложить в форму, испечь 50 мин при 170°C.",
    "ingredient_ids": [5, 2, 4, 1, 9, 12]
  },
  {
    "id": 23,
    "name": "Торт «Красный бархат»",
    "description": "Яркий бисквит с особым вкусом и кремом из сыра.",
    "recipe": "1. Взбить масло с сахаром. 2. Добавить яйца, пахту, краситель. 3. Ввести муку, какао, соду. 4. Испечь коржи. 5. Собрать торт с кремом из крем-сыра и масла.",
    "ingredient_ids": [5, 2, 4, 1, 10, 12, 38]
  },
  {
    "id": 24,
    "name": "Пирожное «Картошка»",
    "description": "Простое и любимое с детства пирожное из печенья.",
    "recipe": "1. Измельчить печенье в крошку. 2. Смешать с мягким маслом, сгущенкой и какао. 3. Сформировать «картошки». 4. Обвалять в какао или кокосовой стружке.",
    "ingredient_ids": [25, 5, 12, 3]
  },
  {
    "id": 25,
    "name": "Фруктовое желе",
    "description": "Легкий и освежающий десерт из свежих фруктов.",
    "recipe": "1. Замочить желатин. 2. Фрукты нарезать, разложить по формам. 3. Сок нагреть, растворить в нем желатин и сахар. 4. Залить фрукты, охладить до застывания.",
    "ingredient_ids": [22, 2, 27, 30]
  },
  {
    "id": 26,
    "name": "Слойки с яблоками",
    "description": "Слоеные пирожки с нежной яблочной начинкой.",
    "recipe": "1. Раскатать слоеное тесто. 2. Яблоки нарезать, смешать с сахаром и корицей. 3. Выложить начинку на тесто, защипнуть. 4. Смазать яйцом, выпекать 25 мин при 200°C.",
    "ingredient_ids": [1, 5, 30, 2, 20, 4]
  },
  {
    "id": 27,
    "name": "Пахлава",
    "description": "Сладкий восточный десерт из слоеного теста с орехами и сиропом.",
    "recipe": "1. Раскатать тонко тесто. 2. Измельчить орехи с сахаром. 3. Выложить слои теста, перемазывая ореховой смесью. 4. Нарезать ромбами, выпекать 40 мин. 5. Залить горячим медовым сиропом.",
    "ingredient_ids": [1, 15, 2, 14, 5]
  },
  {
    "id": 28,
    "name": "Пирог с маком",
    "description": "Пирог с насыщенной маковой начинкой.",
    "recipe": "1. Запарить мак, измельчить с сахаром. 2. Приготовить дрожжевое тесто. 3. Раскатать тесто, выложить начинку. 4. Свернуть рулетом, дать подойти. 5. Выпекать 40 мин при 180°C.",
    "ingredient_ids": [1, 2, 4, 6, 5]
  },
  {
    "id": 29,
    "name": "Тирамису в чашке",
    "description": "Быстрая версия тирамису без выпечки.",
    "recipe": "1. Взбить маскарпоне с сахарной пудрой и сливками. 2. Печенье обмакнуть в кофе. 3. Выкладывать в чашку слоями: крем, печенье, какао. 4. Повторить слои. Охладить 2 часа.",
    "ingredient_ids": [24, 3, 23, 25, 36, 12]
  },
  {
    "id": 30,
    "name": "Печенье «Сырники»",
    "description": "Хрустящее сырное печенье к кофе.",
    "recipe": "1. Натереть сыр на терке. 2. Смешать с мукой, маслом и специями. 3. Замесить тесто, раскатать. 4. Вырезать фигурки, выпекать 15 мин при 190°C.",
    "ingredient_ids": [11, 1, 5, 35, 20]
  }
]
